import { OverlayScrollbarsComponent } from 'overlayscrollbars-react';

export const termsConditions = (
  <OverlayScrollbarsComponent defer>
    <div className="law_information">
      <h2>Угода користувача (Terms & Conditions)</h2>
      <p>1. Прийняття умов</p>
      <p>
        1.1 Використовуючи цей веб-сайт та послуги студії йоги, ви погоджуєтесь
        дотримуватися усіх нижче зазначених умов. Ця Угода користувача становить
        юридичну угоду між вами та студією йоги.
      </p>
      <p>2. Опис послуги</p>
      <p>
        2.1 Студія йоги надає заняття йоги та пов'язані послуги, такі як йога
        практики ретріти, індивідуальні консультації та інші додаткові послуги.
      </p>
      <p>
        2.2 Зареєстровані користувачі мають можливість реєструватися на заняття,
        купувати абонементи або пакети послуг, отримувати розклад занять та
        отримувати повідомлення про спеціальні пропозиції та акції.
      </p>
      <p>3. Реєстрація та облік користувача</p>
      <p>
        3.1 Для використання деяких послуг студії йоги необхідна реєстрація
        облікового запису. Ви зобов'язуєтеся надати точну, актуальну та повну
        інформацію про себе під час реєстрації.
      </p>
      <p>
        3.2 Ви несете відповідальність за збереження конфіденційності свого
        пароля та інформації, пов'язаної з вашим обліковим записом.
      </p>
      <p>
        3.3 Ви зобов'язуєтеся не розголошувати свій пароль або доступ до вашого
        облікового запису третім особам. Ви несете повну відповідальність за всі
        дії, які здійснюються через ваш обліковий запис.
      </p>
      <p>
        3.4 Студія йоги має право призупинити або відключити ваш обліковий запис
        у разі порушення вами цих умов або якщо виникають підозри щодо
        недійсності або зловживання вашого облікового запису.
      </p>
      <p>4. Оплата та відміна занять</p>
      <p>
        4.1 Вартість занять, абонементів, пакетів послуг та додаткових послуг
        вказана на веб-сайті студії йоги. Ви зобов'язуєтесь оплачувати вартість
        послуг вчасно та відповідно до обраних вами опцій.
      </p>
      <p>
        4.2 Студія йоги може застосовувати різні методи оплати, такі як
        онлайн-платежі, платіжні карти, електронні гаманці тощо. Ви згодні, що
        студія йоги не несе відповідальності за будь-які збитки або проблеми,
        пов'язані з платіжними системами третіх осіб.
      </p>
      <p>
        4.3 Ви можете скасувати свою реєстрацію на заняття або змінити свою
        участь у занятті заздалегідь, дотримуючи правил скасування та відміни,
        які зазначені на веб-сайті студії йоги. Студія йоги залишає за собою
        право встановлювати певні обмеження та вимоги щодо скасування та
        відміни.
      </p>
      <p>5. Відмова від відповідальності</p>
      <p>
        5.1 Ви заявляєте та погоджуєтесь, що використовування послуг студії йоги
        та участь у заняттях йоги відбуваються на ваш власний ризик. Студія йоги
        та її власники, співробітники, інструктори та асистенти не несуть
        відповідальності за будь-які травми, збитки, втрати майна або інші
        шкоди, які можуть виникнути внаслідок вашої участі у заняттях йоги або
        використання послуг студії йоги.
      </p>
      <p>
        5.2 Ви зобов'язуєтеся проконсультуватися з лікарем або фахівцем у галузі
        медицини перед початком занять йогою або інших фізичних активностей,
        особливо якщо у вас є будь-які попередні медичні проблеми або обмеження.
      </p>
      <p>
        5.3 Студія йоги не несе відповідальності за будь-які проблеми, недоліки
        або незручності, пов'язані з відсутністю або несправностями обладнання,
        перервами в постачанні електроенергії, проблемами з інтернет-зв'язком
        або будь-якими іншими технічними неполадками.
      </p>
      <p>6. Інтелектуальна власність</p>
      <p>
        6.1 Всі права на логотипи, знаки, назви, текст, графіку, зображення,
        аудіо та відео матеріали, які належать студії йоги, захищені авторським
        правом та іншими законами про інтелектуальну власність. Ви не маєте
        права використовувати, копіювати, розповсюджувати або змінювати ці
        матеріали без попереднього письмового дозволу студії йоги.
      </p>
      <p>7. Зміни в угоді користувача</p>
      <p>
        7.1 Студія йоги залишає за собою право вносити зміни в цю Угоду
        користувача в будь-який час. Оновлена версія Угоди користувача буде
        розміщена на веб-сайті студії йоги. Продовження використанням веб-сайту
        та послуг після внесення змін в Угоду користувача вважатиметься вашою
        згодою з оновленою Угодою.
      </p>
      <p>
        7.2 Рекомендується періодично переглядати Угоду користувача, щоб бути в
        курсі будь-яких змін і оновлень.
      </p>
      <p>8. Припинення</p>
      <p>
        8.1 Ви можете припинити використання веб-сайту та послуг студії йоги в
        будь-який час.
      </p>
      <p>
        8.2 Студія йоги має право припинити надання послуг, припинити роботу
        веб-сайту або скасувати ваш доступ до веб-сайту за своєю власною
        розсудливістю, без попереднього повідомлення і без будь-яких
        обов'язкових зобов'язань.
      </p>
      <p>9. Загальні положення</p>
      <p>
        9.1 Ця Угода користувача підпадає під законодавство вашої країни. У разі
        будь-яких спорів або суперечок, пов'язаних з цією Угодою, сторони
        зобов'язуються спробувати вирішити їх шляхом добровільних переговорів та
        консультацій.
      </p>
      <p>
        9.2 Якщо будь-яке положення цієї Угоди визнається недійсним або
        неінкорпорованим з будь-якої причини, це не впливає на дійсність та
        застосування інших положень цієї Угоди.
      </p>
      <p>
        9.3 За винятком випадків, коли це виключно зазначено в цій Угоді
        користувача, ніщо в цій Угоді не створює жодного виду агентства,
        партнерства, спільного підприємства або працівничого відносини між вами
        та студією йоги.
      </p>
    </div>
  </OverlayScrollbarsComponent>
);

export const privacyPolicy = (
  <OverlayScrollbarsComponent>
    <div className="law_information">
      <h2>Політика конфіденційності</h2>
      <p>Останнє оновлення: [01.05.2023]</p>
      <p>1. Загальні положення</p>
      <p>
        1.1 Ця Політика конфіденційності пояснює, як студія йоги збирає,
        використовує, захищає та розкриває вашу особисту інформацію, яку ви
        надаєте при використанні нашого веб-сайту та послуг.
      </p>
      <p>
        1.2 Ми поважаємо вашу приватність і зобов'язуємося збирати, обробляти та
        зберігати вашу особисту інформацію згідно з діючим законодавством про
        захист даних.
      </p>
      <p>2. Збір і використання інформації</p>
      <p>
        2.1 Під час реєстрації на нашому веб-сайті або при замовленні послуг, ми
        можемо збирати особисту інформацію, таку як ваше ім'я, контактні дані,
        дата народження та іншу інформацію, яку ви надаєте добровільно.
      </p>
      <p>
        2.2 Ми використовуємо зібрану інформацію для надання послуг, керування
        вашим обліковим записом, обробки платежів, комунікації з вами щодо
        послуг, надання спеціальних пропозицій та акцій, а також для покращення
        якості наших послуг та веб-сайту.
      </p>
      <p>
        2.3 Ми можемо використовувати вашу електронну пошту для надсилання
        інформаційних бюлетенів, новин та маркетингових матеріалів, але тільки у
        випадку, якщо ви дали згоду на отримання таких повідомлень. Ви можете в
        будь-який час відмовитися від отримання таких повідомлень, відписавшись
        за допомогою посилання "відмовитися від підписки", що міститься в
        кожному листі.
      </p>
      <p>3. Захист і зберігення інформації</p>
      <p>
        3.1 Ми вживаємо необхідних заходів для захисту вашої особистої
        інформації від несанкціонованого доступу, втрати, використання або
        розкриття. Ми використовуємо технічні та організаційні заходи безпеки,
        такі як шифрування даних, контроль доступу та фізичні обмеження, для
        забезпечення захисту вашої інформації.
      </p>
      <p>
        3.2 Ми зберігаємо вашу особисту інформацію лише протягом необхідного
        періоду, необхідного для досягнення цілей, для яких вона була зібрана,
        або згідно з вимогами законодавства.
      </p>
      <p>4. Розкриття інформації третім сторонам</p>
      <p>
        4.1 Ми можемо передавати вашу особисту інформацію третім сторонам в
        обмежених випадках, включаючи:
        <br />- Постачальникам послуг, які співпрацюють з нами для надання
        послуг, таким як обробка платежів, обслуговування клієнтів та інші.
        <br />- Випадках, коли ми повинні виконувати вимоги законодавства або
        відповідати запитам від уповноважених органів.
      </p>
      <p>
        4.2 Ми не продаватимемо, не передаватимемо або не розкриватимемо вашу
        особисту інформацію третім сторонам для маркетингових цілей без вашої
        попередньої згоди.
      </p>
      <p>5. Посилання на сторонні веб-сайти</p>
      <p>
        5.1 Наш веб-сайт може містити посилання на сторонні веб-сайти, які мають
        власні політики конфіденційності. Ми не несемо відповідальності за збір,
        використання або розкриття вашої інформації сторонніми веб-сайтами.
        Рекомендується ознайомитися з політикою конфіденційності кожного
        стороннього веб-сайту, який ви відвідуєте.
      </p>
      <p>6. Права користувачів</p>
      <p>
        6.1 Ви маєте право отримувати доступ до вашої особистої інформації, яку
        ми збираємо, і виправляти будь-які неточності або неповноту цих даних.
      </p>
      <p>
        6.2 Ви можете також вимагати видалення своєї особистої інформації з
        нашої системи, за винятком випадків, коли зберігання такої інформації
        необхідне з певних юридичних або бізнесових причин.
      </p>
      <p>
        6.3 Якщо ви бажаєте скористатися своїми правами або мати будь-які
        запитання чи скарги щодо обробки вашої особистої інформації, будь ласка,
        зв'яжіться з нами за допомогою контактної інформації, наданої на нашому
        веб-сайті.
      </p>
      <p>7. Зміни до Політики конфіденційності</p>
      <p>
        7.1 Ми можемо час від часу вносити зміни до цієї Політики
        конфіденційності. Будь-які зміни набувають чинності з моменту їх
        публікації на нашому веб-сайті.
      </p>
      <p>
        7.2 Рекомендується періодично переглядати Політику конфіденційності, щоб
        бути в курсі будь-яких змін та оновлень.
      </p>
      <p>8. Зв'язок з нами</p>
      <p>
        8.1 Якщо у вас є будь-які питання, коментарі або запити щодо цієї
        Політики конфіденційності, будь ласка, зв'яжіться з нами за допомогою
        контактної інформації, наданої на нашому веб-сайті.
      </p>
    </div>
  </OverlayScrollbarsComponent>
);

export const cookieFiles = (
  <OverlayScrollbarsComponent>
    <div className="law_information">
      <h2>Політика використання файлів cookie</h2>
      <p>Останнє оновлення: [01.05.2023]</p>
      <p>1. Загальні положення</p>
      <p>
        1.1 Ця Політика використання файлів cookie пояснює, як студія йоги
        використовує файли cookie на своєму веб-сайті і як ці файли cookie
        впливають на вашу приватність.
      </p>
      <p>
        1.2 Файли cookie є невеликими текстовими файлами, які зберігаються на
        вашому комп'ютері або пристрої, коли ви відвідуєте веб-сайт. Вони
        допомагають нам збирати інформацію про ваші переваги та налаштування,
        щоб забезпечити вам кращий досвід користування нашим веб-сайтом.
      </p>
      <p>2. Використання файлів cookie</p>
      <p>
        2.1 Ми використовуємо файли cookie для різних цілей, включаючи:
        <br /> - Забезпечення роботи та оптимальної функціональності нашого
        веб-сайту.
        <br /> - Аналізу використання нашого веб-сайту та отримання статистичної
        інформації, яка допомагає нам покращувати якість та ефективність наших
        послуг.
        <br /> - Запам'ятовування налаштувань та переваг користувачів для
        забезпечення персоналізованого досвіду.
        <br /> - Проведення маркетингових досліджень та відображення релевантної
        реклами нашим користувачам.
      </p>
      <p>3. Треті сторони</p>
      <p>
        3.1 Ми можемо співпрацювати з третіми сторонами, які можуть
        встановлювати файли cookie на вашому пристрої для збору інформації про
        вашу взаємодію з нашим веб-сайтом. Це може включати партнерів з
        аналітики, рекламних мереж та інших.
      </p>
      <p>
        3.2 Зверніть увагу, що ми не контролюємо файли cookie, встановлені
        третіми сторонами, і ця Політика використання файлів cookie не
        поширюється на їхню діяльність. Рекомендується ознайомитися з політиками
        конфіденційності цих третіх сторін, щоб отримати докладну інформацію про
        їхню практику використання файлів cookie.
      </p>
      <p>4. Контроль і відмова від файлів cookie</p>
      <p>
        4.1 Ви маєте можливість керувати використанням файлів cookie на своєму
        пристрої. Ви можете встановити свій веб-браузер таким чином, щоб
        відхиляти всі файли cookie або повідомляти про їхнє встановлення. Також
        ви можете видалити вже наявні файли cookie зі свого пристрою.
      </p>
      <p>
        4.2 Врахуйте, що відмова від використання файлів cookie може обмежити
        ваш доступ до деяких функцій та можливостей нашого веб-сайту і призвести
        до менш задоволеного досвіду користувача.
      </p>
      <p>5. Зміни до політики використання файлів cookie</p>
      <p>
        5.1 Ми можемо періодично оновлювати цю Політику використання файлів
        cookie, щоб відображати зміни в наших практиках використання файлів
        cookie або зміни вимог законодавства. Будь-які зміни вступають в силу з
        моменту їх публікації на нашому веб-сайті.
      </p>
      <p>
        5.2 Рекомендується періодично переглядати політику використання файлів
        cookie, щоб бути в курсі будь-яких змін та оновлень.
      </p>

      <p>6. Зв'язок з нами</p>
      <p>
        6.1 Якщо у вас є будь-які питання, коментарі або скарги щодо нашої
        політики використання файлів cookie, будь ласка, зв'яжіться з нами за
        допомогою контактної інформації, наданої на нашому веб-сайті
      </p>
    </div>
  </OverlayScrollbarsComponent>
);
